################################################################################
# Lec04.R
# 05/06/2022
################################################################################
rm(list = ls()) # all clear

################################################################################
# Reset Graphics
################################################################################
old.par <- par(no.readonly = TRUE)

################################################################################
# Load Libraries
################################################################################
library(tidyverse)
library(readxl)

################################################################################
# Load Functions
################################################################################

################################################################################
# Define Functions
################################################################################

################################################################################
# Set Parameters
################################################################################

################################################################################
# プログラミングの基礎
################################################################################

#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=
# 関数
#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=
Data1 <- c(3, 3, 4, 0, 50, 3, 3, 1, 2, 5)
hist(Data1)
mean(Data1)

# - - - - - [which.max, which.min] 最大・最小値を与えるindex
which.max(Data1)
which.min(Data1)

Tr_Data1 <- Data1[-c(which.max(Data1), which.min(Data1))]
hist(Tr_Data1)
mean(Tr_Data1)

# - - - - - [関数定義] MyTrimMeanという名前の関数を定義する
MyTrimMean <- function(x){
    Tr_x <- x[-c(which.max(x), which.min(x))]
    return(mean(Tr_x))
}

MyTrimMean(Data1)

# - - - - - 実は通常のmean関数にもトリム平均は実装されている
mean(Data1, trim = 0.1)

#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=
# 繰り返し(for)
#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=
# - - - - - ベクトルData1の平均値を計算
n <- length(Data1)
s_Data <- 0
for(i in seq(n)){
    s_Data <- s_Data + Data1[i]
}
print(s_Data / n)

# - - - - - [関数定義] MyMeanという名前の関数を定義する
MyMean <- function(x){
    n <- length(x)
    s_x <- 0
    for(i in seq(n)){
        s_x <- s_x + x[i]
    }
    return(s_x / n)
}
MyMean(Data1)

#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=
# 条件分岐(if, else)
#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=
# - - - - - [if, else] 条件によって処理を変える
x <- -2
# x <- c(-2, 3)
# - - - - - if文の条件式にベクトルが入ると警告が出る
if(x >= 0){
    print(x)
} else {
    print(-x)
}

# - - - - -  ifelse関数はベクトルに対応
ifelse(x >=0, x, -x)


# - - - - - ベクトルData1の最大値・最小値及びそのインデックスを計算
n <- length(Data1)
Max_Index <- Min_Index <- 1
Max_Data <- Min_Data <- Data1[1]

for(i in seq(2, n)){
    if (Data1[i] > Max_Data){
        Max_Data <- Data1[i]
        Max_Index <- i
    }
    if (Data1[i] < Min_Data){
        Min_Data <- Data1[i]
        Min_Index <- i
    }
}

# - - - - - [関数定義] MyWhichMaxMinという名前の関数を定義する
MyWhichMaxMin <- function(x){
    n <- length(x)
    Max_Index <- Min_Index <- 1
    Max_Data <- Min_Data <- x[1]
    
    for(i in seq(2, n)){
        if (x[i] > Max_Data){
            Max_Data <- x[i]
            Max_Index <- i
        }
        if (x[i] < Min_Data){
            Min_Data <- x[i]
            Min_Index <- i
        }
    }
    return(c(Max_Index, Min_Index))
}

MyWhichMaxMin(Data1)

# - - - - - [関数定義] MyTrimMean2という名前の関数を定義する
MyTrimMean2 <- function(x){
    Tr_x <- x[-MyWhichMaxMin(x)]
    return(MyMean(Tr_x))
}

MyTrimMean2(Data1)


################################################################################
# 人口動態調査の2020年全死因・男性の年齢調整死亡率を計算(Lec02の復習)
################################################################################
VS_Dir <- "VS/"

#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=
# 死亡数読み込み
#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=
# - - - - - [read_excel関数] Excelファイルを読み込む
D00_raw <- read_excel(path = paste0(VS_Dir, "mc150000.xlsx"), 
                      sheet = 1, skip = 7, col_names = TRUE, col_types = "numeric")

# D00M <- c(D00_raw$`2020`[seq(26, 44)], sum(D00_raw$`2020`[seq(45, 46)]))

D00M <- c(unlist(D00_raw[seq(26, 44), as.character(2020)]), sum(unlist(D00_raw[seq(45, 46), as.character(2020)])))
D00M[is.na(D00M)] <- 0  

#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=
# 人口読み込み
#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=
# - - - - - [read_csv関数] CSVファイルを読み込む
PopM_raw <- read_csv(file = paste0(VS_Dir, "mi030002.csv"),
                     skip = 11, col_names = TRUE, col_types = list(.default = "n"))

#PopM <- c(PopM_raw$`2020`[seq(7, 25)], sum(PopM_raw$`2020`[seq(26, 27)]))

PopM <- c(unlist(PopM_raw[seq(7, 25), as.character(2020)]), sum(unlist(PopM_raw[seq(26, 27),  as.character(2020)])))
Mx00M <- D00M / PopM

#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=
# 平成27年モデル人口読み込み
#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=#=
ModelPop_raw <- read_excel(path = paste0(VS_Dir, "kijunjinkou(h27).xlsx"), 
                           sheet = 1, skip = 5, col_names = FALSE, col_types = "numeric")
ModelPop <- c(sum(ModelPop_raw[seq(2), 2]), unlist(ModelPop_raw[-seq(2), 2]))

Cx_ModelPop <- ModelPop / sum(ModelPop)

sum(Mx00M * Cx_ModelPop) * 100000


################################################################################
# 人口動態調査の2020年男性の全ての死因の年齢調整死亡率を計算
################################################################################
ASDR2020M <- numeric(17)
names(ASDR2020M) <- paste0("HI", seq(0, 16))
ASDR2020M[1] <- sum(Mx00M * Cx_ModelPop) * 100000










################################################################################
# 人口動態調査の2015-2020年の男性の全ての死因の年齢調整死亡率を計算
################################################################################
ASDRM <- matrix(NA, nrow = 17, ncol =  6)
dimnames(ASDRM) <- list(paste0("HI", seq(0, 16)), seq(2015, 2020))











